Merge branch 'feat/ai-chat-redesign'
# Conflicts:
#	README.md
